#변수 문자열(str) 정수형(d) 실수형(float) 문자 하나(c)
#print 출력시 출력할 값에 문자열을 넣을 경우 ''안에 값을 지정해야한다.
print('hello')
#형식지정은 값을 지정하는 것으로 변수형에 따라 기호가 다르다.
gold = 'black'
silver = 2020
bronze = 1818.181818

print('나에게 금(%s)이 있다.' %gold)
print('나에게는 은(%d)이 있다.' %silver)
print('나에게는 동(%.2f)이있다.' %bronze)
print('hello \"world\"')
print('hello \tworld')
print('hello \nworld')

#format 함수

print('Breakfast is {1} and {1}'.format('spam','egg'))

print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')

zipcode = '06236' #문자열
file = '25852'
print('우편번호 : {zip}'.format(zip=zipcode))
print('우편번호 : {file}'.format(file = file))
address ='''서울시 강남구 테헤란로 146'''
print('주소 : {addr}'.format(addr=address))

tel1 = '02'
tel2 = '032'
tel3 = '1234'
tel4 = '4544'
tel5 = '1248'
print('연락처 : {0}-{1}-{2}'.format(tel1,tel2,tel5))
print('연락처 : {}-{}-{}'.format(tel5,tel1,tel1))
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')


zipcode = '06233'
address = '''서울시 강남구 테헤란로 146'''
phone = 2,538,21

print('우편번호 : %s' %zipcode)
print('주소 : %s' %address)
print('핸드폰 : %d-%d-%d' %phone)

print('0')
print('int(0)')
int(0)

print(0)

print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
#input 함수는 모든 입력을 문자열로 저장한다.

name  = input('이름을 말씀해주세요')
print('환영합니다.')

n = input('정수를 입력하세요')
math = int(input('수학 점수를 입력하세요.'))

print(n)
print('수학 점수는 %d점입니다.'%math)


na = input('이름을 입력하세요>>>')
ag = int(input('나이를 입력하세요>>>'))

print('입력된 이름은 {}입니다.'.format(na))
print('입력된 나이는 %d살입니다.'%ag)
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
#형식지정
name = input('이름을 입력하세요>>>')
age = int(input('나이를 입력하세요>>>'))
phone = input('전화번호를 입력하세요>>>')
day = input('오늘이 무슨 날인지 알려주세요>>>')
print('제 이름은 %s입니다.' %name)
print('제 나이는 %d살입니다.' %age)
print('제 전화번호는 %s입니다.' %phone)
print('오늘은 %s입니다.' %day)
print('-------------------------------------------------------')
print('-------------------------------------------------------')
print('-------------------------------------------------------')
#format함수

ame = input('이름을 입력하세요 >>>')
ge = int(input('나이를 입력하세요 >>>'))
ph = input('전화번호를 입력하세요 >>>')
da = input('오늘은 무슨 요일인가요? >>>')
print('제 이름은 {}입니다.'.format(ame))
print('제 나이는 {}살입니다.'.format(ge))
print('제 전화번호는 {}입니다.'.format(ph))
print('오늘은 {}입니다.'.format(da))




























