#대입연산자
저금통 = int(0)
money = int(10000)

저금통 += money
print('저금통에 용돈 %d원을 넣었습니다.'%money)
print('지금 저금통에는 %d원이 있습니다.'%저금통)

과자 = int(2000)
저금통 -= 과자
print('저금통에서 스낵 구입비 %d원을 뺐습니다.'%과자)
print('지금 저금통에는 %d원이 있습니다.'%저금통)

print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
#저금통에 얼마가 있는 지 입력하고 쓰고 남은 돈이 얼마인지를 알려주는 프로그램을 구성해보세요
'''저금통에 얼마가 있습니까?>>>
저금통에는 얼마가 있습니다.
과자는 얼마입니까?>>>
과자는 얼마입니다.
그래서 남은 돈은 얼마입니다.
'''
bank = int(input('저금통에 얼마가 있습니까?>>>'))
print('저금통에는 %d원이 있습니다.'%bank)
snack = int(input('과자는 얼마입니까?>>>'))
print('과자는 %d원입니다.' %snack)
print('그래서 남은 돈은 %d원입니다.'%(bank-snack))
print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')


number1 = 20
number2 = 30

print('number1과 number2의 값을 교환하여 저장해보세요.')
print('number1은 20입니다.')
print('number2은 30입니다.')
number1+=10
number2-=10
print('교환한 결과는\nnumber1은 %d \nnumber2은 %d입니다.'%(number1,number2))
print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
#관계 연산자

print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')


a = 10
b = 0
print('a = 10')
print('b = 0')
print('a는 0보다 크고, b는 0보다 크다.')
print('%d > 0 and %d > 0 : %s' %(a,b,a>0 and b>0))
print('a는 0보다 크고, b는 0보다 크다.')
print('%d > 0 or %d > 0 : %s' %(a,b,a>0 or b>0))
print('not %d : %s' %(a, not b)) #출력값을 반대로 
print('not %d : %s' %(b, not a))

c = 'morning'
d = 'night'
print('%s은 %s이다. : %s' %(c,c,not d))
print('%s은 %s이다. : %s' %(c,d, not d))

print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')

#삼항 연산자 a if b(조건값) else c
#if = 라면, else = 아니면
#국어, 영어, 수학 점수를 각각 입력받아서 평균을 구하고,
#평균이 60점 이상이면 '합격', 아니면 '불합격'
#을 출력하는 프로그램을 구현하세요.
'''국어 점수를 입력하세요 >>> 85
영어 점수를 입력하세요 >>> 83
수학 점수를 입력하세요 >>> 81
평균은 83.0점이고, 결과는 합격입니다.
'''
국 = int(input('국어 점수를 입력하세요 >>>'))
영 = int(input('영어 점수를 입력하세요 >>>'))
수 = int(input('수학 점수를 입력하세요 >>>'))    

합 = 국 + 영 + 수
print('총합 : %d'%(국+영+수))
평 = 합/float(3) 
print('평균 : %.2f'%(합/3))

값 = '합격' if 평>=60 else '불합격'
print('평균은 %.2f점이고, 결과는 %s입니다.'%(평,값))

print('---------------------------------------')
print('---------------------------------------')
print('---------------------------------------')
#청팀인지 백팀인지를 물어보고 적군인지 아군인지를 판별하는 프로그램을 만들어라
'''당신은 무슨팀입니까?>>>
그렇다면 당신은 우리의 아군입니다.
'''
input('당신은 무슨팀입니까?>>>')
청 = 청팀
백 = 백팀

result = "아군" if 청팀>=청팀 else "적군"

print('그렇다면 당신은 우리의 %s입니다.'%(result))





























