print(100, 200, 300) #print는 출력을 해주는 명령어 (100, 200, 300)은 출력

print("Hello")
print(2022)
print(3.14)

a = 5

print(a)
print(a)
print(a)
print(a)
print(a)

print(100,200,300,sep=',');

print('Hello\'World\'')
print('Hello\nWorld\'')
print('Hello\tWorld\'')
print('%s'%'Hello World')

print('%5d'%1)
print('%5d'%22)
print('---------------------------------------------------')
print('%.6f'%3.141592)
print('---------------------------------------------------')
name= 'kai'
print('제 이름은 %s입니다.'%name);

height = 120.5
print('제 키는 %.1fcm입니다.'%height);

weight = 23.55
print('제 몸무게는 %.2fkg입니다.'%weight);

year, month, day = 2014,8,25
print('제 생일은 %d년 %d월 %d일 입니다.'%(2014,8,25));
print('---------------------------------------------------')
print('---------------------------------------------------')
print('---------------------------------------------------')
print('---------------------------------------------------')
print('---------------------------------------------------')

int(1.9)
print='int'
